StructuralAssetId Property
 The ElementId of the structural PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId StructuralAssetId { get; set; }
Visual Basic
Public Property StructuralAssetId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ StructuralAssetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →